Hugh1ezy/claude-pokemon-buddy/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash: 16MB QIO @ 80MHz (matches Waveshare ESP32-S3-RLCD-4.2)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Custom partition table: IDF's singleapp default caps the app at 1MB and leaves
# the other ~15MB of a 16MB part unaddressable. See partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OPI (octal) PSRAM — display_bsp allocates DispBuffer + pixel LUTs in SPIRAM,
# so PSRAM MUST be up or RLCD_Init's assert(DispBuffer) crashes at boot.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Free the USB-Serial-JTAG port for the binary host link: route console logs
# to UART0 and disable the secondary USB-Serial-JTAG console (else it fights
# the usb_serial_jtag driver for the same peripheral).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
